package com.example.searchcuisineappliction.data

object Constance {
    //названия
    const val PASTA_KARBONARA = "Паста карбонара"
    const val LAZANIA_CLASSIC = "Лазанья классическая"
    const val PIZZA_PEPPERONI = "Пицца Пепперони"
    const val SALAT_CEZAR = "Салат Цезарь классический"
    const val BORSH = "Борщ"
    const val KOTLETA_PO_KIEVSKI = "Котлета по-киевски"
    const val DRANIKI = "Драники"
    const val KOLOLAK = "Кололак"
    const val KUFTA = "Кюфта"
    const val TOLMA = "Толма"
    const val USA_GAMBURGER = "Американский гамбургер"
    const val HOLLIWOOD_BIFSTAKE = "Голливудский бифштекс"
    const val KORN_DOG = "Корн Дог"
    const val GAMBO = "Гамбо"
    const val LECHO = "Лечо"
    const val PAPRIKASH_FROM_TURKEY = "Паприкаш из индейки"

    //рецепт
    const val RECIPE_PASTA_KARBONARA =
        "Спагетти варить 7-10 минут в кипящей подсоленной воде и откинуть на дуршлаг. В сковороде разогрейте оливковое масло, положите чеснок и слегка подрумяньте. Ветчину/бекон мелко нарежьте, добавьте к чесноку и обжаривайте 5 минут. Сыр пармезан натрите на мелкой терке. Желтки взбить со сливками, немного подсолить. Спагетти переложить в сотейник с чесноком и ветчиной/беконом. Добавить взбитые желтки и тёртый сыр, перемешать. Держать на огне 3 минуты. Посыпать молотым перцем, украсить зеленью и подавать на стол."
    const val RECIPE_LAZANIA_CLASSIC =
        "В сотейник положить сливочное масло и 2 ложки растительного масла, растопить. Постепенно добавлять муку и размешивать так, чтобы не оставалось комочков. Когда вся мука вмешана, влить все молоко. Убавить огонь и томить до нужной консистенции: не жидкой, но и не слишком густой. Консистенция нежирной сметаны. На сковороде раскалить оливковое масло. Добавить мясной фарш (лучше свинина+телятина). Фарш жарить до полуготовности. Влить в него соус болоньезе, посолить и поперчить по вкусу. Духовку разогреть до 180 градусов. Форму смазать сливочным маслом. На дно вылить немного соуса бешамель, чуть-чуть, только чтобы покрыть дно. Выложить пласты (не вареные). На пласты выложить получившийся фарш (не жалеем!), на фарш — натертый сыр. На сыр — соус бешамель. Соуса нужно выкладывать столько, сколько необходимо, на ваш взгляд, чтобы лазанья получилась сочной. Поверх соуса выложить сухие листы лазаньи. Повторить процедуру.Последний слой листов промазать соусом бешамель и сверху щедро засыпать сыром. Дать постоять минут 7–10. Поставить в духовку. Печь 30 минут."
    const val RECIPE_PIZZA_PEPPERONI =
        "Сначала сделай соус: смешай томаты со специями, измельчённым чесноком, сахаром, солью и перцем. Доведи до кипения и остуди. Раскатай тесто, смажь его оливковым маслом и соусом. Посыпь половиной сыра, выложи колбасу и тонко нарезанный чили. Сверху — оставшийся сыр. Готовь в духовке 10-12 минут при 220 градусах."
    const val RECIPE_SALAT_CEZAR =
        "Промыть, просушить и нарвать на небольшие кусочки листья салата, отложить в холодильник. В горячую сковородку положить 1 столовую ложку сливочного масла. После того, как оно полностью расплавится и начнет шипеть, кинуть нарезанный на пластины зубчик чеснока. Куриную грудку нарезать на кусочки приблизительно 1×3 см. Положить в сковороду к чесноку и маслу. Обжаривать на сильном огне приблизительно 10 минут до румяной корочки. Снять с огня. В ту же сковородку добавить еще одну столовую ложку сливочного масла и второй зубчик чеснока. В это время нарезать на небольшие кубики хлеб. Положить в сковороду и обжаривать до румяной корочки. Желательно непрерывно помешивать, чтобы не подгорело. Достать листья салата, туда же положить обжаренную куриную грудку, помидоры, нарезанные тонкой соломкой. Заправить соусом «Цезарь». Перемешать. Сверху положить получившиеся сухарики и натереть сыр."
    const val RECIPE_BORSH =
        "Сварить мясной бульон. Свеклу, морковь, петрушку и лук нарезать соломкой, положить в суповую кастрюлю, добавить помидоры или томат-пюре, уксус, сахар и немного бульона с жиром (или добавить 1-2 ст. ложки масла), закрыть крышкой и поставить овощи тушить. Овощи перемешивать, чтобы не пригорели, прибавляя, если нужно, немного бульона или воды. Через 15-20 минут добавить нашинкованную капусту, все перемешать и тушить еще 20 минут. Затем овощи залить подготовленным мясным бульоном, положить перец, лавровый лист, соль, добавить по вкусу немного уксуса и варить до полной готовности овощей. При подаче на стол в борщ положить сметану. В борщ при варке добавляют картофель в целом виде или нарезанный дольками, а также свежие помидоры. Их также нарезают дольками и кладут в борщ за 5-10 минут до окончания варки. В готовый борщ кроме мяса можно положить вареную ветчину, сосиски или колбасу. Для подкрашивания борща можно сделать свекольный настой. Для этого одну свеклу нарезать ломтиками, залить стаканом горячего бульона, добавить чайную ложку уксуса и поставить на 10-15 минут на слабый огонь и довести до кипения. После этого настой процедить и влить в борщ перед подачей на стол."
    const val RECIPE_KOTLETA_PO_KIEVSKI =
        "Курицу разделать так, чтобы получить два филе грудки вместе с плечевой костью на ножке. Снять кожу. Филе положить внутренней стороной вверх, надрезать от середины вдоль в обе стороны, положить половинки так, чтобы поместилась начинка, и аккуратно отбить. Белые сухожилия подрезать, чтобы котлеты не съежились. В миске смешать нашинкованную петрушку, масло и соль, тщательно перемешать до получения однородной массы. Разделить смесь на две части, придать форму и убрать на 3–5 минут в морозилку. Затем положить на филе и плотно завернуть котлету, снова убрать в морозилку на 3–5 минут. В миске соединить яйца и молоко и взбить. Котлеты обвалять в муке, затем в смеси. Затем обвалять в панировке, затем в смеси, затем снова в панировке. Аккуратно примять. В емкость для фритюра налить масло и разогреть до 200 градусов. Разогреть до 200 градусов духовку. Поджарить котлеты во фритюре до золотистой корочки (примерно 5 минут), затем довести до готовности в духовке в течение 10 минут. Перед подачей на стол промокнуть салфеткой."
    const val RECIPE_DRANIKI =
        "Набор ингредиентов небольшой и недорогой, так что это довольно универсальное блюдо на каждый день. Очистите и натрите на терке картофель. Сразу же добавьте сок лимона (по желанию), чтобы картофель не темнел. Добавьте сметану, муку, соль по вкусу. Вбейте яйцо. Все как следует перемешайте. На сковороде разогрейте растительное масло. Ложкой выкладывайте массу на сковороду и жарьте драники с двух сторон до румяной корочки. Приятного аппетита!"
    const val RECIPE_KOLOLAK =
        "Помыть и нарезать зелень. Пшено отварить до готовности, добавить фарш и яичный желток, посолить, поперчить и тщательно перемешать до однородности. Лук нарезать и обжарить на растопленном сливочном масле до мягкости. Рис отварить до готовности. Добавить к рису половину нарезанной зелени и половину обжаренного лука. Посолить и поперчить по вкусу. Перемешать до однородности. Из фарша слепить шарики размером с куриное яйцо. Сделать в шариках углубление и выложить в него 1 ч. л. рисовой начинки. Тщательно залепить сверху фаршем и скатать шарики. Шарики получаются довольно крупными. Важно хорошо слепить половинки, иначе шарики при варке распадутся. Картошку очистить и нарезать. Бульон довести до кипения. Положить в него картошку, оставшийся обжаренный лук и томатное пюре (пасту). Довести до кипения и варить 5 минут. Добавить фрикадельки. Варить на небольшом огне, пока шарики не всплывут. Выправить на соль, добавить хмели-сунели. Выключить огонь и дать постоять 10 минут."
    const val RECIPE_KUFTA =
        "Для начала нам необходимо измельчить говядину до состояния кашицы, для этого мы либо пропускаем мясо 5-6 раз через мясорубку, либо измельчаем в кухонном комбайне. В процессе измельчения вливаем в фарш молоко или воду. Когда фарш станет однородный, мы перекладываем его в миску и добавляем яйцо, муку измельченный лук, коньяк, солим и перчим. Теперь все это необходимо тщательно вымешивать в течение 20 минут. В кастрюлю наливаем воду, ставим на огонь, солим. Приготовленную массу мы делим на 4 равные части, каждую из которых делим еще на 4 части. Формируем из фарша шарики, смочив руки водой. Когда вода в кастрюльке закипит, аккуратно опускаем в нее приготовленный мясные фрикадельки. Варим примерно пол часа и не забываем снимать образующуюся пену. По истечении времени шарики можно извлекать из воды и нарезать. Подают кюфту горячей, полив топленым сливочным маслом. Приятного аппетита!"
    const val RECIPE_TOLMA =
        "Листья винограда варить в чуть подсоленной воде минут 5. Мясо пропустить через мясорубку. Добавить мелко-нарезанный лук, зелень и круглый рис. Затем фарш тщательно перемешать руками, добавив небольшое количество теплой воды. Аккуратно выложить фарш на виноградный лист — чайную ложку фарша на лист. Чем мельче толма, тем она вкуснее. Выложить толму в глубокую кастрюлю плотно так, чтобы толма не раскрылась во время приготовления. Залить холодной водой (чтобы уровень воды был чуть больше уровня толмы). Для того, чтобы толма не всплывала, сверху положить чистую тарелку. Не закрывать крышкой. На среднем огне толма варить приблизительно 40 минут. Показателем готовности блюда является готовый рис в фарше. Нужно дать постоять несколько минут не снимая тарелку, чтобы бульон впитался в толму. Если вы не использовали в фарше свинину, то добавьте небольшое количество сливочного масла в фарш."
    const val RECIPE_USA_GAMBURGER =
        "Мелко нарежь бекон и каперсы, добавь их в фарш, посоли и поперчи. Сформируй из этого объема 4 крупные котлеты, равномерно обжарь и собери гамбургеры."
    const val RECIPE_HOLLIWOOD_BIFSTAKE =
        "Лук очистить. Мелко нарезать лук. Сделать углубления в фарше мадлером или ложкой. Выложить лук в углубление. Нарезать базилик. Выложить сверху базилик. Добавить нарезанную моцареллу. Приправить сыр специями. Вбить одно яйцо в начинку и распределить желток. Накрыть сверху второй котлетой. Сделать углубление в верхней котлете. Добавить яйца в углубление и присыпать черным перцем. Отправить емкость с бифштексом в разогретую до 180 градусов духовку. Через 10–15 минут достать готовое блюдо."
    const val RECIPE_KORN_DOG =
        "Смешиваем сухие ингредиенты в емкости с высокими стенками, чтобы в дальнейшем было легко окунать сосиски. Добавляем яйцо, перемешиваем, вливаем молоко до получения очень густого теста. Сосиски предварительно обваливаем в муке. Прокалываем каждую сосиску шпажкой и окунаем в тесто полностью, чтобы верхняя часть шпажки тоже покрылась тестом. Разогреваем фритюр до 150-170 градусов, обжариваем сосиски в тесте. Подаем с любимыми соусами и наслаждаемся!"
    const val RECIPE_GAMBO =
        "В сотейник с толстым дном всыпать муку и влить масло, на медленном огне обжарить, постоянно помешивая. Должно получиться по консистенции песочного теста и шоколадного цвета. Это займет 30–45 минут. Можно добавлять масло или муку, чтобы добиться необходимого результата. Сварить рис до готовности в течение 20–25 минут. На сковороде обжарить кружочки колбасы на каждой стороне до коричневого цвета. На той же сковороде с оставшимся жиром от колбасы обжарить лук, сельдерей и чеснок, чеснок нужно добавлять в самом конце жарки, чтобы он не подгорел. Бульон влить в кастрюлю для супа, добавить ру (мучную смесь) и хорошо перемешать. Добавить нарезанные овощи, довести до кипения и варить 5–7 минут, пока овощи не станут мягкими. Вмешать специи, затем добавить колбасу, куриное мясо, креветки, измельченную петрушку и зеленый лук. Попробовать и добавить соль и перец по вкусу. Подавать гамбо теплым, налив его поверх вареного риса."
    const val RECIPE_LECHO =
        "Стручки зеленого перца очистить и нарезать широкими полосками. Помидоры на несколько секунд опустить в кипяток, вынуть, очистить от кожицы и нарезать на четвертинки. Лук нашинковать полукольцами. В широкую кастрюлю положить жир и поджарить на нем до прозрачности мелкие кубики шпика, всыпать нашинкованный лук и подрумянить его до светло-коричневого цвета. Добавить паприку, быстро размешать и тотчас же положить нарезанные зеленый перец и помидоры. Посолить и тушить сначала без крышки на сильном огне, затем, когда часть жидкости выпарится, готовить под крышкой на умеренном огне до готовности."
    const val RECIPE_PAPRIKASH_FROM_TURKEY =
        "Филе индейки нарезаем кусочками, крупную луковицу — небольшими кубиками. Также нарезаем морковь и болгарский перец (любого цвета). Чеснок мелко порубить. Помидоры сейчас совершенно безвкусные, поэтому я решила использовать томаты в собственном соку, которые готовит моя сестричка из собственноручно выращенных помидоров. Я их очищаю и нарезаю перед готовкой. В сотейнике с толстым дном разогреваем растительное масло и обжариваем индейку. Добавляем лук и жарим до прозрачности. Теперь добавляем морковь и продолжаем обжаривать пару минут. Добавить сладкий болгарский перец и продолжить обжаривать, помешивая. Добавить нарезанные кубиками помидоры, измельченный чеснок и посыпать паприкой (автор не указала количество паприки, поэтому 2 чайные ложки — это мои личные предпочтения). Перемешать и обжарить несколько минут. Залить все небольшим количеством воды, чтобы жидкость прикрыла мясо, посолить по вкусу и немного потушить. Сметану смешать с мукой. Добавить в паприкаш. Тушить до готовности мяса. Готовый паприкаш из индейки подавать с любимым гарниром."

    //ингредиенты
    const val BASILIK = "Базилик сушеный"
    const val BECON = "Бекон"
    const val BULION_KUR = "Бульон куриный"
    const val BULION_MIX= "Бульон (говяжий на косточке)"
    const val BULOCHKI = "Булочки"
    const val VETCHINA = "Ветчина"
    const val GOVIADINA = "Говядина"
    const val LIST_LAZANI = "Готовые сухие листы лазаньи"
    const val ZHIR_SVIN = "Жир свиной"
    const val ZELEN = "Зелень"
    const val SALAT_ZELEN = "Зеленый салат"
    const val PEPER_KAIENSKI = "Кайенский перец"
    const val KAPERCI = "Каперсы"
    const val KAPUSTA= "Капуста белокачаная"
    const val KARTOFEL = "Картофель"
    const val KOLBASA = "Колбаса сырокопченая"
    const val KOLBASA_KRACK = "Колбаса краковская"
    const val KONIAK= "Коньяк"
    const val KORENIA= "Коренья"
    const val KOTLETA = "Котлета для бургера"
    const val KREVETKI = "Креветки вареные"
    const val KURIZA = "Курица"
    const val KURIZA_GRIL = "Курица гриль"
    const val LISTYA_VINOGR = "Листья винограда"
    const val LISTIA_BASILIKA = "Листья базилика"
    const val LUK_REPCH = "Лук репчатый"
    const val LUK_ZELEN = "Лук зеленый"
    const val LUK_SUSH = "Лук сушеный молотый"
    const val MASLO_OLIVE = "Масло оливковое"
    const val MASLO_SLIV = "Масло сливочное"
    const val MASLO_RASTIT = "Масло растительное"
    const val MOLOKO = "Молоко"
    const val MORKOV = "Морковь"
    const val MUKA = "Мука пшеничная"
    const val MUKA_KUKU = "Мука кукурузная"
    const val MYASO= "Мясо"
    const val MYKOT_GOV= "Мякоть говядины"

    const val OVOSHI = "Овощи"
    const val OREGANO = "Орегано"
    const val PAPRIKA = "Паприка"
    const val PAPRIKA_SPACY = "Паприка острая"
    const val TOMATO_PASTA= "Паста томатная"
    const val PETRUSHKA = "Петрушка"
    const val PEPER_CHILI = "Перец чили"
    const val PEPER_CHILI_HLOP = "Перец чили хлопьями"
    const val PEPER_BLACK = "Перец черный молотый"
    const val PEPER_RED = "Перец красный молотый"
    const val PEPER_SLAD = "Перец сладкий"
    const val PEPER_SPICY = "Перец острый"
    const val POMIDORI = "Помидоры"
    const val POMIDORY_V_SOKU = "Помидоры в собственном соку"
    const val TOMATO_PURE= "Пюре томатное"
    const val PSHENO= "Пшено"

    const val RAZRUHLITEL = "Разрыхлитель теста"
    const val RICE= "Рис"

    const val SAHAR = "Сахар"
    const val SVEKLA= "Свекла"
    const val SVININA = "Свинина"
    const val SELDEREI = "Сельдерей"
    const val SLIVKI_10 = "Сливки 10%-ные"
    const val SOSISKI = "Сосиски"
    const val SPAGETTI = "Cпагетти"
    const val SMETANA = "Сметана"
    const val SMES_PERCEV = "Смесь перцев"
    const val SMES_TRAV = "Смесь пряных трав"
    const val SOUSE_BOL = "Соус болоньезе"
    const val SOUSE_CEZ = "Соус «Цезарь»"
    const val CIR_PARMEZAN = "Сыр пармезан"
    const val CIR_TVERDI = "Сыр твердый"
    const val CIR_MOZAR = "Сыр моцарелла"
    const val SUHARI = "Сухари панировочные"
    const val SOLT = "Соль"
    const val SOLT_SEA = "Соль морская"
    const val TESTO_PIZZA = "Тесто для пиццы"
    const val TIMIAN = "Тимьян"

    const val UKSUS= "Уксус"
    const val FARSH_MYASN = "Фарш мясной"
    const val FILE_KURIN = "Филе куриное"
    const val FILE_IND = "Филе индейки"
    const val HLEB = "Хлеб белый"
    const val HMELI_SUNELI = "Хмели-сунели"
    const val CHESNOK = "Чеснок"
    const val CHESNOK_SUSH = "Чеснок сушеный молотый"
    const val SHPIK = "Шпик копченый"
    const val YAICHNI_ZHELTOK = "Яичный желток"
    const val YAIZO = "Яйцо"
}